{
  "name": "Tejas Ghodke",
  "bio": "Web developer and student at the University of Cincinnati, Cincinnati, OH. Available for COOP in Fall 2025.",
  "contact": {
    "location": "Cincinnati, OH",
    "phone": "(513) 537-3591",
    "email": "ghodketg@mail.uc.edu",
    "linkedin": "https://linkedin.com/in/ghodketguc",
    "github": "https://github.com/ghodketejas"
  },
  "origin": {
    "hometown": "Pune, India",
    "languages": {
      "English": "Full Fluency",
      "Hindi": "Full Fluency",
      "Marathi": "Full Fluency",
      "German": "Beginner"
    }
  },
  "education": {
    "degree": "Bachelor of Science in Computer Science",
    "university": "University of Cincinnati",
    "graduation": "May 2027",
    "honors": ["Dean’s List: Summer ’23, Fall ’23, Summer ’24, Fall ’24"],
    "relevant_coursework": [
      "Design and Analysis of Algorithms",
      "Software Engineering",
      "Database Design and Development",
      "Probability and Statistics",
      "Web Applications and Hacking"
    ]
  },
  "previous_education": [
    {
      "institution": "The Rewachand Bhojwani Academy",
      "level": "High School (Grade 1 – 10)",
      "location": "Pune, India",
      "website": "https://www.rbacademy.org/"
    },
    {
      "institution": "Sir Parshurambhau Junior College (SP College)",
      "level": "Junior College (11th and 12th Grade)",
      "location": "Pune, India",
      "stream": "PCM (Physics, Chemistry, Mathematics) with Bifocal in Computer Science",
      "website": "https://www.spcollegepune.ac.in/"
    }
  ],
  "experience": [
    {
      "company": "iKomet Technology Solutions",
      "location": "Pune, India",
      "title": "Junior Intern",
      "dates": "February 2024 – April 2024",
      "highlights": [
        "Designed and implemented an advanced Python program using SpaCy and pandas to extract, parse, and organize specific data from large 5,000-word documents into formatted Excel spreadsheets for streamlined analysis.",
        "Benchmarked against the previous internal tool, the new SpaCy-based program demonstrated a 25% speed improvement and 12% higher accuracy on a 10,000-page dataset, ensuring more reliable classification, structured representation, and seamless integration across the entire data pipeline infrastructure.",
        "Demonstrated advanced problem-solving by designing a fully automated, scalable data pipeline that streamlined extraction, sorting, and presentation workflows, with outputs directly integrated into dynamic Power BI dashboards for enhanced data visualization accuracy and overall analytical efficiency."
      ]
    },
    {
      "company": "Campus Recreation Center",
      "location": "Cincinnati, Ohio",
      "title": "Aquatics Supervisor",
      "dates": "May 2023 – Present",
      "highlights": [
        "Demonstrated proactive leadership within a diverse lifeguard team consisting of more than 60 lifeguards by fostering a collaborative, inclusive, and high-performance environment, and by providing ongoing mentorship, support, guidance, and constructive performance feedback to both new and veteran staff members.",
        "Ensured full emergency preparedness by implementing detailed safety protocols, guiding lifeguards through drills, and delivering immediate, hands-on response during real-time incidents to safeguard all patrons and staff."
      ]
    }
  ],
  "projects": [
    {
      "name": "Advanced Tic-Tac-Toe Game",
      "location": "Cincinnati, Ohio",
      "dates": "April 2024 – July 2024",
      "type": "Personal Project",
      "technologies": ["Flutter", "Dart", "Android Studio", "VS Code", "GitHub", "GitHub Actions", "Material Design", "StatefulWidget", "SharedPreferences", "Cross-platform Development"],
      "highlights": [
        "Developed a modern, cross-platform implementation of Advanced Tic-Tac-Toe using Flutter and Dart, featuring a strategic 3x3 grid of tic-tac-toe boards with adaptive AI system and comprehensive statistics tracking.",
        "Implemented an intelligent AI opponent with difficulty levels ranging from 0-100, featuring smart strategy evaluation, winning move detection, and opponent move blocking capabilities that adapt to player skill level.",
        "Built a beautiful dark-themed UI with neon blue and orange accents, animated floating grid backgrounds, and responsive design that works seamlessly across Android, iOS, Web, Windows, macOS, and Linux platforms.",
        "Established automated CI/CD pipeline using GitHub Actions for continuous deployment to GitHub Pages, ensuring the web version is always up-to-date with the latest features and improvements.",
        "Integrated comprehensive data persistence using SharedPreferences for statistics tracking, game preferences, and user progress, creating a personalized gaming experience with persistent win/loss/draw records."
      ]
    },
    {
      "name": "Snake Game – AI Agent",
      "location": "Cincinnati, Ohio",
      "dates": "January 2025 – March 2025",
      "type": "Personal Project",
      "technologies": ["Python 3.10", "PyTorch 2.x", "NumPy", "Matplotlib", "Pygame", "Scikit-learn", "Reinforcement Learning", "Deep Q-Learning (DQN)", "CUDA", "Anaconda", "Multiprocessing", "GPU Acceleration"],
      "highlights": [
        "Enhanced Patrick Loeber's Snake-AI tutorial by implementing sophisticated reinforcement learning techniques, richer game state representations, and a fully reproducible training and benchmarking pipeline for autonomous gameplay optimization.",
        "Developed two distinct AI agents: a baseline DQN agent and an enhanced agent with deeper neural networks, improved reward shaping, and richer state representations, achieving significant performance improvements through advanced machine learning techniques.",
        "Implemented comprehensive training infrastructure with flexible configuration options, including visual popup interfaces for debug/train mode selection, customizable game speeds, and unique model/plot/CSV saving with sequential naming for easy benchmarking.",
        "Utilized GPU acceleration with RTX 5070 Ti (16 GB GDDR7) for efficient model training, achieving ~300% average score improvement across 10,000+ episodes through reward-based strategy refinement and optimized neural network architectures.",
        "Created automated training and comparison workflows with multiprocessing plotting capabilities, ensuring smooth visualization during training sessions and comprehensive performance analysis between different model configurations."
      ]
    }
  ],
  "skills": {
    "programming": ["Python (Certified)", "Java (OCAJP) SE 8", "C/C++", "HTML and CSS", "PHP", "MATLAB", "Dart", "SQL", "R", "JavaScript"],
    "operating_systems": ["Linux (multiple flavors)", "Windows", "MacOS", "Android", "iOS", "ChromeOS"],
    "tools_software": ["SpaCy", "Pytorch", "Git", "Anaconda", "Docker", "Android Studio", "MySQL", "CUDA", "LabView", "MS Azure", "VMs"]
  },
  "fun_facts": {
    "karate": "I am a black belt in Shotokan Karate, earned in 6th grade.",
    "soccer": "I am a huge soccer fan and a regular player. I love FC Barcelona and was captain of my high school team.",
    "gaming": "I enjoy gaming across all genres except tabletop RPGs like DnD. I play FIFA/EA FC, EA F1, and story-driven games like Hogwarts Legacy and Uncharted.",
    "tech_preference": "I prefer Android over Apple in all categories."
  },
  "availability": "Available for COOP in Fall 2025"
}
